# Проект FitLife - MVP версия 1.0

# 1. Знакомство
# TODO: Спроси у пользователя имя и сохрани в переменную user_name
# TODO: Спроси возраст и сохрани в переменную user_age (не забудь преобразовать в число)


# 2. Сбор данных
# TODO: Запроси вес (в кг) и сохрани в user_weight (тип float)
# TODO: Запроси рост (в метрах, например 1.75) и сохрани в user_height (тип float)


# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# TODO: Рассчитай bmi (Индекс массы тела)


# Подсчет воды: вес * 30 мл
# TODO: Рассчитай water_needed


# 4. Вывод красивого результата
# TODO: Используй f-строку, чтобы вывести приветствие, например: "Привет, Иван!"
# TODO: Выведи возраст, ИМТ (округленный до 1 знака) и норму воды.

print('Добрый день! Введите данные для расчета.')
user_name = input('Введите имя:')
user_age = int(input('Введите возраст:'))


user_weight = float(input('Введите вес в килограммах:'))
user_height = float(input('Введите рост в метрах:'))

bmi = user_weight/(user_height**2)
bmi = round(bmi, 1)


water_ml = user_weight * 30
water_needed = water_ml/1000


print(f'Привет !, {user_name}, {user_age}, лет')
print(f'Индекс массы тела: {bmi}')
print(f'Норма воды в день: {water_needed}лМак')
print("Расчет окончен. Будьте здоровы!")
